<?php

the_posts_pagination(array(
  'show_all'     => false, // показаны все страницы участвующие в пагинации
  'end_size'     => 1,     // количество страниц на концах
  'mid_size'     => 1,     // количество страниц вокруг текущей
  'prev_next'    => true,  // выводить ли боковые ссылки "предыдущая/следующая страница".
  'prev_text'    => __('<svg xmlns="http://www.w3.org/2000/svg" width="7" height="13"><path fill="currentColor" fill-rule="evenodd" d="M.426 6.425c0-.204.078-.409.235-.565l4.815-4.807a.808.808 0 0 1 1.137-.002.8.8 0 0 1 .002 1.133L2.367 6.425l4.248 4.241a.8.8 0 0 1-.002 1.134.806.806 0 0 1-1.137-.002L.661 6.991a.793.793 0 0 1-.235-.566z"/></svg>'),
  'next_text'    => __('<svg xmlns="http://www.w3.org/2000/svg" width="7" height="12"><path fill="currentColor" fill-rule="evenodd" d="M6.57 6.424a.794.794 0 0 1-.235.565L1.52 11.796a.808.808 0 0 1-1.137.002.8.8 0 0 1-.002-1.133l4.248-4.241L.381 2.183A.8.8 0 0 1 .383 1.05a.807.807 0 0 1 1.137.001l4.815 4.807a.795.795 0 0 1 .235.566z"/></svg>'),
  'add_args'     => true, // Массив аргументов (переменных запроса), которые нужно добавить к ссылкам.
  'add_fragment' => '',     // Текст который добавиться ко всем ссылкам.
));